1682/1682.16/Output/Fluid/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    interface
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    inlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    outlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    top
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    bottom
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    slip-bottom
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
